In [1]:
%matplotlib inline

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [4]:
# Create a path to the csv and read it into a Pandas DataFrame
city_df = pd.read_csv("raw_data/city_data.csv")
ride_df = pd.read_csv("raw_data/ride_data.csv")

print(city_df.head())
print(ride_df.head())

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban
                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [8]:
city_count = ride_df.groupby(['city'], as_index=False)['fare'].count()
print(city_count.head())
fare_sum = ride_df.groupby(['city'], as_index=False)['fare'].sum()
print(fare_sum.head())

            city  fare
0    Amandaburgh    18
1    Barajasview    22
2  Barronchester    16
3    Bethanyland    18
4   Bradshawfurt    10
            city    fare
0    Amandaburgh  443.55
1    Barajasview  557.31
2  Barronchester  582.76
3    Bethanyland  593.21
4   Bradshawfurt  400.64

In [13]:
temp_df= pd.merge(city_count, fare_sum, on="city")
temp_df = temp_df.rename(columns={'fare_x': 'Rides', 'fare_y': 'Total Cost'})
temp_df.head()

            city  Rides  Total Cost
0    Amandaburgh     18      443.55
1    Barajasview     22      557.31
2  Barronchester     16      582.76
3    Bethanyland     18      593.21
4   Bradshawfurt     10      400.64